Model: "cnn1d"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 cnn1d_input (InputLayer)    [(None, 100, 6)]          0         
                                                                 
 conv1d_3 (Conv1D)           (None, 100, 64)           1216      
                                                                 
 conv1d_4 (Conv1D)           (None, 100, 64)           12352     
                                                                 
 batch_normalization_1 (Bat  (None, 100, 64)           256       
 chNormalization)                                                
                                                                 
 max_pooling1d_1 (MaxPoolin  (None, 50, 64)            0         
 g1D)                                                            
                                                                 
 conv1d_5 (Conv1D)           (None, 50, 128)           24704     
                                                                 
 global_average_pooling1d_1  (None, 128)               0         
  (GlobalAveragePooling1D)                                       
                                                                 
 dropout_1 (Dropout)         (None, 128)               0         
                                                                 
 dense_1 (Dense)             (None, 3)                 387       
                                                                 
=================================================================
Total params: 38915 (152.01 KB)
Trainable params: 38787 (151.51 KB)
Non-trainable params: 128 (512.00 Byte)
_________________________________________________________________