Model: "hybrid"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 time_input (InputLayer)     [(None, 100, 6)]             0         []                            
                                                                                                  
 spec_input (InputLayer)     [(None, 33, 2, 1)]           0         []                            
                                                                                                  
 conv1d_16 (Conv1D)          (None, 100, 64)              1216      ['time_input[0][0]']          
                                                                                                  
 conv2d_11 (Conv2D)          (None, 33, 2, 32)            320       ['spec_input[0][0]']          
                                                                                                  
 global_average_pooling1d_6  (None, 64)                   0         ['conv1d_16[0][0]']           
  (GlobalAveragePooling1D)                                                                        
                                                                                                  
 global_average_pooling2d_6  (None, 32)                   0         ['conv2d_11[0][0]']           
  (GlobalAveragePooling2D)                                                                        
                                                                                                  
 concatenate_1 (Concatenate  (None, 96)                   0         ['global_average_pooling1d_6[0
 )                                                                  ][0]',                        
                                                                     'global_average_pooling2d_6[0
                                                                    ][0]']                        
                                                                                                  
 dense_22 (Dense)            (None, 128)                  12416     ['concatenate_1[0][0]']       
                                                                                                  
 dropout_16 (Dropout)        (None, 128)                  0         ['dense_22[0][0]']            
                                                                                                  
 dense_23 (Dense)            (None, 3)                    387       ['dropout_16[0][0]']          
                                                                                                  
==================================================================================================
Total params: 14339 (56.01 KB)
Trainable params: 14339 (56.01 KB)
Non-trainable params: 0 (0.00 Byte)
__________________________________________________________________________________________________