Model: "hybrid"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 time_input (InputLayer)     [(None, 20, 6)]              0         []                            
                                                                                                  
 spec_input (InputLayer)     [(None, 9, 1, 1)]            0         []                            
                                                                                                  
 conv1d_15 (Conv1D)          (None, 20, 64)               1216      ['time_input[0][0]']          
                                                                                                  
 conv2d_10 (Conv2D)          (None, 9, 1, 32)             320       ['spec_input[0][0]']          
                                                                                                  
 global_average_pooling1d_5  (None, 64)                   0         ['conv1d_15[0][0]']           
  (GlobalAveragePooling1D)                                                                        
                                                                                                  
 global_average_pooling2d_5  (None, 32)                   0         ['conv2d_10[0][0]']           
  (GlobalAveragePooling2D)                                                                        
                                                                                                  
 concatenate (Concatenate)   (None, 96)                   0         ['global_average_pooling1d_5[0
                                                                    ][0]',                        
                                                                     'global_average_pooling2d_5[0
                                                                    ][0]']                        
                                                                                                  
 dense_20 (Dense)            (None, 128)                  12416     ['concatenate[0][0]']         
                                                                                                  
 dropout_15 (Dropout)        (None, 128)                  0         ['dense_20[0][0]']            
                                                                                                  
 dense_21 (Dense)            (None, 3)                    387       ['dropout_15[0][0]']          
                                                                                                  
==================================================================================================
Total params: 14339 (56.01 KB)
Trainable params: 14339 (56.01 KB)
Non-trainable params: 0 (0.00 Byte)
__________________________________________________________________________________________________