Model: "cnn1d"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 cnn1d_input (InputLayer)    [(None, 20, 6)]           0         
                                                                 
 conv1d_12 (Conv1D)          (None, 20, 64)            1216      
                                                                 
 conv1d_13 (Conv1D)          (None, 20, 64)            12352     
                                                                 
 batch_normalization_4 (Bat  (None, 20, 64)            256       
 chNormalization)                                                
                                                                 
 max_pooling1d_4 (MaxPoolin  (None, 10, 64)            0         
 g1D)                                                            
                                                                 
 conv1d_14 (Conv1D)          (None, 10, 128)           24704     
                                                                 
 global_average_pooling1d_4  (None, 128)               0         
  (GlobalAveragePooling1D)                                       
                                                                 
 dropout_4 (Dropout)         (None, 128)               0         
                                                                 
 dense_4 (Dense)             (None, 3)                 387       
                                                                 
=================================================================
Total params: 38915 (152.01 KB)
Trainable params: 38787 (151.51 KB)
Non-trainable params: 128 (512.00 Byte)
_________________________________________________________________