Model: "lstm"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_input (InputLayer)     [(None, 100, 6)]          0         
                                                                 
 bidirectional_8 (Bidirecti  (None, 100, 128)          36352     
 onal)                                                           
                                                                 
 bidirectional_9 (Bidirecti  (None, 64)                41216     
 onal)                                                           
                                                                 
 dropout_9 (Dropout)         (None, 64)                0         
                                                                 
 dense_13 (Dense)            (None, 64)                4160      
                                                                 
 dense_14 (Dense)            (None, 3)                 195       
                                                                 
=================================================================
Total params: 81923 (320.01 KB)
Trainable params: 81923 (320.01 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________