Model: "hybrid"
__________________________________________________________________________________________________
 Layer (type)                Output Shape                 Param #   Connected to                  
==================================================================================================
 time_input (InputLayer)     [(None, 100, 6)]             0         []                            
                                                                                                  
 spec_input (InputLayer)     [(None, 33, 2, 1)]           0         []                            
                                                                                                  
 conv1d_19 (Conv1D)          (None, 100, 64)              1216      ['time_input[0][0]']          
                                                                                                  
 conv2d_14 (Conv2D)          (None, 33, 2, 32)            320       ['spec_input[0][0]']          
                                                                                                  
 global_average_pooling1d_9  (None, 64)                   0         ['conv1d_19[0][0]']           
  (GlobalAveragePooling1D)                                                                        
                                                                                                  
 global_average_pooling2d_9  (None, 32)                   0         ['conv2d_14[0][0]']           
  (GlobalAveragePooling2D)                                                                        
                                                                                                  
 concatenate_4 (Concatenate  (None, 96)                   0         ['global_average_pooling1d_9[0
 )                                                                  ][0]',                        
                                                                     'global_average_pooling2d_9[0
                                                                    ][0]']                        
                                                                                                  
 dense_28 (Dense)            (None, 128)                  12416     ['concatenate_4[0][0]']       
                                                                                                  
 dropout_19 (Dropout)        (None, 128)                  0         ['dense_28[0][0]']            
                                                                                                  
 dense_29 (Dense)            (None, 3)                    387       ['dropout_19[0][0]']          
                                                                                                  
==================================================================================================
Total params: 14339 (56.01 KB)
Trainable params: 14339 (56.01 KB)
Non-trainable params: 0 (0.00 Byte)
__________________________________________________________________________________________________