Model: "lstm"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 lstm_input (InputLayer)     [(None, 20, 6)]           0         
                                                                 
 bidirectional_4 (Bidirecti  (None, 20, 128)           36352     
 onal)                                                           
                                                                 
 bidirectional_5 (Bidirecti  (None, 64)                41216     
 onal)                                                           
                                                                 
 dropout_7 (Dropout)         (None, 64)                0         
                                                                 
 dense_9 (Dense)             (None, 64)                4160      
                                                                 
 dense_10 (Dense)            (None, 3)                 195       
                                                                 
=================================================================
Total params: 81923 (320.01 KB)
Trainable params: 81923 (320.01 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________