Model: "cnn2d"
_________________________________________________________________
 Layer (type)                Output Shape              Param #   
=================================================================
 cnn2d_input (InputLayer)    [(None, 33, 2, 1)]        0         
                                                                 
 conv2d (Conv2D)             (None, 33, 2, 32)         320       
                                                                 
 batch_normalization_5 (Bat  (None, 33, 2, 32)         128       
 chNormalization)                                                
                                                                 
 conv2d_1 (Conv2D)           (None, 33, 2, 64)         18496     
                                                                 
 batch_normalization_6 (Bat  (None, 33, 2, 64)         256       
 chNormalization)                                                
                                                                 
 global_average_pooling2d (  (None, 64)                0         
 GlobalAveragePooling2D)                                         
                                                                 
 dropout_10 (Dropout)        (None, 64)                0         
                                                                 
 dense_15 (Dense)            (None, 3)                 195       
                                                                 
=================================================================
Total params: 19395 (75.76 KB)
Trainable params: 19203 (75.01 KB)
Non-trainable params: 192 (768.00 Byte)
_________________________________________________________________